DataProcessors/УдалитьЗадвойВДополнительныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>УдалитьЗадвойВДополнительныхДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Телефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Телефоны</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТелефонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодтверждениеДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/УдалитьЗадвойВДополнительныхДанных/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УдалитьВСправочникеДопДанные(Команда)
	
	 УдалитьНаСервере(Объект.Реестр);
	 
	 Сообщить("Ок");
	
КонецПроцедуры


&НаСервере
Процедура УдалитьНаСервере(реестр)

					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	РеестрДолжники.Должник КАК Должник,
						|	РеестрДолжники.Договор КАК Договор
						|ИЗ
						|	Документ.Реестр.Должники КАК РеестрДолжники
						|ГДЕ
						|	РеестрДолжники.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", реестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				 	
						Запись=Объект.ТЧ.Добавить();
						
						Запись.Должник=ВыборкаДетальныеЗаписи.Должник;
						Запись.Договор=ВыборкаДетальныеЗаписи.Договор;
	
						
						
					КонецЦикла;
					
					
					Для каждого стр  Из Объект.ТЧ  Цикл
						
						  УдалитьСпрДополнительныеДанные(стр.Должник);
						  
						  УдалитьТелефоны(стр.Должник);
						  
						  УдалитьАдреса(стр.Должник);

					
					КонецЦикла;
					
	

				КонецПроцедуры
				
&НаСервере				
Процедура УдалитьАдреса(долж)

	     ТемпАдреса.Очистить();
		 
		  	
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Адреса.Ссылка КАК Ссылка,
							|	Адреса.Тип КАК Тип,
							|	Адреса.Адрес КАК Адрес
							|ИЗ
							|	Справочник.Адреса КАК Адреса
							|ГДЕ
							|	Адреса.Владелец = &Владелец";
						
						Запрос.УстановитьПараметр("Владелец", долж);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							записьА=ТемпАдреса.Добавить();
							
							записьА.Тип=ВыборкаДетальныеЗаписи.Тип;
							записьА.Адрес=ВыборкаДетальныеЗаписи.Адрес;
							записьА.СсылкаАдрес=ВыборкаДетальныеЗаписи.Ссылка;
							
							
						КонецЦикла;
						
						
						
						Для каждого стр Из ТемпАдреса Цикл
							
							
							    ПоменятьДвойныеАдреса(стр.Адрес,стр.Тип );
							
						
						КонецЦикла;
		 
	 
	                    УдалитьВсеАдреса();
	

КонецПроцедуры

&НаСервере
Процедура УдалитьВсеАдреса()

	
	   	Для каждого стр Из АдресаДляУдаления  Цикл

			
						        	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Адреса.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Адреса КАК Адреса
					|ГДЕ
					|	Адреса.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", стр.АдресСсылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					        элемСправ= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
										  
							элемСправ.Удалить();
										  

					
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			
			
			
			
	    КонецЦикла;
	

КонецПроцедуры

					
					
				

&НаСервере
Процедура ПоменятьДвойныеАдреса(адрес, тип)

	      Т3= ТемпАдреса.Выгрузить();

		  
		       				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&Т3 КАК Т3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.Тип КАК Тип,
					|	ТВ_ТВ.Адрес КАК Адрес,
					|	ТВ_ТВ.СсылкаАдрес КАК СсылкаАдрес
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.Тип = &Тип И ТВ_ТВ.Адрес=&Адрес
					|";
				
				Запрос.УстановитьПараметр("Тип",тип);
				
				Запрос.УстановитьПараметр("Адрес", адрес);
			    Запрос.УстановитьПараметр("Т3", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();

				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		       
				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.СсылкаАдрес);
					
				     КонецЦикла;

				
				КонецЕсли;

				Для каждого стр Из массивНомерстр Цикл

					 НулевыеСтроки = ТемпАдреса.НайтиСтроки(Новый Структура("СсылкаАдрес",стр));

					 Для каждого стрД Из НулевыеСтроки Цикл
     
						 
						 
						    записьТТ= АдресаДляУдаления.Добавить(); 
							записьТТ.АдресСсылка=стрД.СсылкаАдрес;
							
						   	ТемпАдреса.Удалить(стрД);
			 
						 
					 КонецЦикла;
					
    			КонецЦикла;

				
	
	

КонецПроцедуры


				
				
&НаСервере
Процедура  УдалитьТелефоны(долж)

	  ТемпТелефоны.Очистить();
	
	  
							    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
							// Данный фрагмент построен конструктором.
							// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	Телефоны.Ссылка КАК Ссылка,
								|	Телефоны.Код КАК Код,
								|	Телефоны.Наименование КАК Наименование,
								|	Телефоны.Подтверждение КАК Подтверждение,
								|	Телефоны.Тип КАК Тип,
								|	Телефоны.Номер КАК Номер
								|ИЗ
								|	Справочник.Телефоны КАК Телефоны
								|ГДЕ
								|	Телефоны.Владелец = &Владелец";
							
							Запрос.УстановитьПараметр("Владелец", долж);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								// Вставить обработку выборки ВыборкаДетальныеЗаписи
								 записьТ=ТемпТелефоны.Добавить();
								 записьТ.Тип=ВыборкаДетальныеЗаписи.Тип;
								 
								 записьТ.Номер=ВыборкаДетальныеЗаписи.Номер;
								 записьТ.Подтверждение=ВыборкаДетальныеЗаписи.Подтверждение;
								 записьТ.НаименованиеСтр=ВыборкаДетальныеЗаписи.Наименование;
								 записьТ.Код=ВыборкаДетальныеЗаписи.Код;
								 записьТ.СсылкаТел=ВыборкаДетальныеЗаписи.Ссылка;
								 
								
							КонецЦикла;
							
							//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

							 Для каждого стр Из ТемпТелефоны  Цикл
						 
								   ПометитьДвойныеТелефоны(стр.Номер,стр.Тип);
					 	
					 
					         КонецЦикла;
  
							
							УдалитьВсеТелефоныДолж(долж);
							
							
							

КонецПроцедуры


&НаСервере
Процедура ПометитьДвойныеТелефоны(номер, типт)
	
	            Т3= ТемпТелефоны.Выгрузить();

			  				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&Т3 КАК Т3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.Тип КАК Тип,
					|	ТВ_ТВ.Код КАК Код,
					|	ТВ_ТВ.СсылкаТел КАК СсылкаТел,
					|	ТВ_ТВ.Номер КАК Номер
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.Тип = &Тип И ТВ_ТВ.Номер=&Номер
					|";
				
				Запрос.УстановитьПараметр("Тип",типт);
				
				Запрос.УстановитьПараметр("Номер", номер);
			    Запрос.УстановитьПараметр("Т3", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();

				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.Код);
					
					  
					
				     КонецЦикла;

				
				КонецЕсли;
				

				
				Для каждого стр Из массивНомерстр Цикл
				
    				   НулевыеСтроки = ТемпТелефоны.НайтиСтроки(Новый Структура("Код",стр));
					   
					   Для каждого стрД Из НулевыеСтроки Цикл
						   
						     Если ЕстьлиТакойТелефонВКонтактах(стрД.СсылкаТел) Тогда
								записьТ=ТелефоныВКонтактах.Добавить();
								записьТ.СсылкаТел=стрД.СсылкаТел;
								записьТ.Номер=стрД.Номер;
							 
							 КонецЕсли;
							 
							 
						 	записьТТ= ТелефоныДляУдаления.Добавить(); 
							записьТТ.СсылкаТел=стрД.СсылкаТел;
							
							
						   	ТемпТелефоны.Удалить(стрД);
							   
							   
					   КонецЦикла;
					   
					     
	  
					   
				КонецЦикла;

				
			  
	

КонецПроцедуры
			
&НаСервере
Функция ЕстьлиТакойТелефонВКонтактах(ссылкаТ)
       телвКонтактахЕсть=Ложь;
	
	      	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	КонтактТелефоны.Телефон.Номер КАК ТелефонНомер,
						|	КонтактТелефоны.Ссылка КАК СсылкаКонтакт,
						|	КонтактТелефоны.Телефон.Ссылка КАК ТелефонСсылка
						|ИЗ
						|	Документ.Контакт.Телефоны КАК КонтактТелефоны
						|ГДЕ
						|	КонтактТелефоны.Телефон.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", ссылкаТ);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      телвКонтактахЕсть=Истина;
						
					
					КонецЕсли;
					
					//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
					//КонецЦикла;
					//
					
					
					
					
					
					
	   Возврат  телвКонтактахЕсть;

КонецФункции // ()


			



&НаСервере
Процедура УдалитьСпрДополнительныеДанные(долж)
	
	   
	
	  ТемпДопДанные.Очистить();
	
					         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ДополнительныеДанные.Ссылка КАК Ссылка,
						|	ДополнительныеДанные.Код КАК Код,
						|	ДополнительныеДанные.Наименование КАК Наименование,
						|	ДополнительныеДанные.Реквизит КАК Реквизит
						|ИЗ
						|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
						|ГДЕ
						|	ДополнительныеДанные.Владелец = &Владелец";
					
					Запрос.УстановитьПараметр("Владелец", долж);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						
					     записьТ=ТемпДопДанные.Добавить();
						 записьТ.РеквизитДопДанные= ВыборкаДетальныеЗаписи.Реквизит;
						 
						 записьТ.НаименованиеСтр=ВыборкаДетальныеЗаписи.Наименование;
						 
						 записьТ.Код=ВыборкаДетальныеЗаписи.Код;
						
						
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					
					
					 Для каждого стр Из ТемпДопДанные  Цикл
						 
						      ПометитьДвойные(стр.РеквизитДопДанные,стр.НаименованиеСтр);
					 	
					 
					 КонецЦикла;
					
					
					 УдалитьВсеДопДанныеДолж(долж);
					 
					 
					 
					 Для каждого стр Из ТемпДопДанные Цикл
					 
						   спрЭлемент=Справочники.ДополнительныеДанные.СоздатьЭлемент();
						   
						   спрЭлемент.Владелец=долж;
						   
						   спрЭлемент.Реквизит=стр.РеквизитДопДанные;
						   
						   спрЭлемент.Наименование=стр.НаименованиеСтр;
						   
						   спрЭлемент.Записать();
						 
					 
					 КонецЦикла;
					 
					 
											
					
	

КонецПроцедуры
					

&НаСервере
Процедура УдалитьВсеТелефоныДолж(долж)

  	         массивСсылок=Новый массив;
			 
						//Запрос = Новый Запрос;
						////Запрос.Текст = 
						//	"ВЫБРАТЬ
						//	|	Телефоны.Ссылка КАК Ссылка
						//	|ИЗ
						//	|	Справочник.Телефоны КАК Телефоны
						//	|ГДЕ
						//	|	Телефоны.Владелец = &Владелец";
						//
						//Запрос.УстановитьПараметр("Владелец", долж);
						//
						//РезультатЗапроса = Запрос.Выполнить();
						//
						//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						//
						//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

						//		массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);

						//	
						//КонецЦикла;
						//
						
						
						
						
				// Поменять в контактах телефон
    			Если ТелефоныВКонтактах.Количество()>0 Тогда
					
					Для каждого стрк  Из ТелефоныВКонтактах  Цикл
					
						  стДубль= ТемпТелефоны.НайтиСтроки(Новый Структура("Номер",стрк.Номер));
						  
						  Для каждого стрД Из стДубль Цикл
							  
							   ПоменятьНомерТелефонаВКонтакте(стрк.СсылкаТел, стрД.СсылкаТел);
							  
						  КонецЦикла;	  
						  
						     
		
				
				    КонецЦикла;

					
				
				КонецЕсли;
				
				
						
						
						
						
						
	        	Для каждого стр Из ТелефоныДляУдаления  Цикл
					
													            	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
									// Данный фрагмент построен конструктором.
									// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ
										|	Телефоны.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Телефоны КАК Телефоны
										|ГДЕ
										|	Телефоны.Ссылка = &Ссылка";
									
									Запрос.УстановитьПараметр("Ссылка", стр.СсылкаТел);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										// Вставить обработку выборки ВыборкаДетальныеЗаписи
										
										  элемСправ= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
										  
										  элемСправ.Удалить();
										  
										
									КонецЦикла;
									
									//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					//			 элемСправ= стр.ПолучитьОбъект();					
					//
					//             элемСправ.Удалить();
					//
					
					
					
				
				КонецЦикла;

			 
			 
	
КонецПроцедуры

&НаСервере
Процедура ПоменятьНомерТелефонаВКонтакте(ссылкаТелБыл, новаяссылка)

	    массивСсылок=Новый Массив;
	
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	КонтактТелефоны.Ссылка КАК Ссылка,
							|	КонтактТелефоны.Телефон КАК Телефон
							|ИЗ
							|	Документ.Контакт.Телефоны КАК КонтактТелефоны
							|ГДЕ
							|	КонтактТелефоны.Телефон = &Телефон";
						
						Запрос.УстановитьПараметр("Телефон", ссылкаТелБыл);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							  
							  массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
							
							
						КонецЦикла;
						
						
						
						Для каждого стрдок  Из массивСсылок Цикл
							
							док=стрдок.ПолучитьОбъект();
							
							массивСтрок = док.Телефоны.НайтиСтроки(Новый Структура("Телефон",ссылкаТелБыл));
							
							Для каждого стрТел  Из массивСтрок Цикл
								
								стрТел.Телефон= новаяссылка;
								
							
							КонецЦикла;
							
							док.Записать();
							
							
							
						
						КонецЦикла;
						
						
						
						
	

КонецПроцедуры



&НаСервере
Процедура УдалитьВсеДопДанныеДолж(долж)

	      массивСсылок=Новый массив;
	
				      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДополнительныеДанные.Ссылка КАК Ссылка,
					|	ДополнительныеДанные.Владелец КАК Владелец
					|ИЗ
					|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
					|ГДЕ
					|	ДополнительныеДанные.Владелец = &Владелец";
				
				Запрос.УстановитьПараметр("Владелец", долж);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					массивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
				Для каждого стр Из массивСсылок  Цикл
					элемСправ= стр.ПолучитьОбъект();					
					
					элемСправ.Удалить();
				
				КонецЦикла;
				
				
	
КонецПроцедуры




&НаСервере
Процедура ПометитьДвойные(рек, наим)

	
					Т3= ТемпДопДанные.Выгрузить();
									

								
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
				    | *	
					|ПОМЕСТИТЬ ТВ_ТВ
					|ИЗ
					|	&ТЗ КАК ТЗ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТВ_ТВ.РеквизитДопДанные КАК РеквизитДопДанные,
					|	ТВ_ТВ.Код КАК Код,
					|	ТВ_ТВ.НаименованиеСтр КАК НаименованиеСтр
					|ИЗ
					|	ТВ_ТВ КАК ТВ_ТВ
					|ГДЕ
					|	ТВ_ТВ.НаименованиеСтр = &Имя И ТВ_ТВ.РеквизитДопДанные=&РеквизитДопДанные
					|";
				
				Запрос.УстановитьПараметр("Имя",наим);
				
				Запрос.УстановитьПараметр("РеквизитДопДанные", рек);
			    Запрос.УстановитьПараметр("ТЗ", Т3);

				
				 массивНомерстр=Новый Массив;

				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
				
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					         ВыборкаДетальныеЗаписи.Следующий();
							 массивНомерстр.Добавить(ВыборкаДетальныеЗаписи.Код);
					
					  
					
				     КонецЦикла;

				
				КонецЕсли;
				
				
				Для каждого стр Из массивНомерстр Цикл
				
    				   НулевыеСтроки = ТемпДопДанные.НайтиСтроки(Новый Структура("Код",стр));
					   
					   Для каждого стрД Из НулевыеСтроки Цикл
					   
					   	     ТемпДопДанные.Удалить(стрД);
					   
					   КонецЦикла;
					   
					     
	  
					   
				КонецЦикла;
				
				
			
	
	
	

КонецПроцедуры
